#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>


//// 二维数组
//int main() {
//	int a[3][4] = { 0 };
//
//	printf("%d\n", sizeof(a));          //  48  整个数组
//	printf("%d\n", sizeof(a[0][0]));	//   4  第一个元素
//
//	//  16  第一行元素
//	// a[0]是 第一行这个一维数组的数组名，也是第一行数组首元素地址
//	// sizeof 单独放a[0] 代表求第一行整个数组的大小
//	printf("%d\n", sizeof(a[0]));		
//	printf("%d\n", sizeof(a[0]+1));		// 4或8 第一行第二列元素地址
//	printf("%d\n", sizeof(*(a[0] + 1)));//	4   第一行第二列元素
//
//
//	printf("%d\n", sizeof(a+1));	 	// 4或8 第二行元素首地址
//
//	//  16   第二行首元素
//	// *(a+1) = a[1]
//	// 第二行大小
//	printf("%d\n", sizeof(*(a + 1)));	//  16   第二行
//
//	// a[0] 第一行数组名
//	// &a[0] 第一行数组地址
//	// &a[0]+1 第二行数组地址
//	printf("%d\n", sizeof(&a[0]+1));	// 4或8 第二行地址
//		
//
//	// &a[0]+1 第二行数组地址
//	// 第二行数组解引用，求第二行数组元素
//	printf("%d\n", sizeof(*(&a[0] + 1)));// 16  第二行数组大小
//
//	printf("%d\n", sizeof(*a));			//  4   第一个元素
//	printf("%d\n", sizeof(a[3]));		//  16，sizeof 只判断类型
//	return 0;
//}




// 指针

//int main() {
//	int a[5] = { 1,2,3,4,5 }; 
//
//	int* ptr = (int*)(&a + 1); // 跳过整个数组，指向数组下一个
//
//	// *(a+1) 第二个元素
//	// *(ptr-1) 最后一个元素
//	printf("%d,%d\n", *(a + 1), *(ptr - 1));
//
//	return 0;
//}


//struct Test {
//	int num;
//	char* pcName;
//	short sDate;
//	char cha[2];
//	short sBa[4];
//}*p; // 结构体对象指针
//
//// 假设p的值为 0x100000，下面的表达式结果为？？
//// 已知 Test结构体类型的变量大小为20个字节 
////
//int main() {
//
//	// 指针加1 ，加20个字节 ，0x00100014
//	printf("%p\n",p+0x1); //
//
//	// 0000 0000 0001 0000 0000 0000 0000 0000
//	// 0000 0000 0001 0000 0000 0000 0000 0001
//	// 0001 0000 0000 0000 0000 0000 0000 0001
//	// 0x 00 10 00 01
//	printf("%p\n",(unsigned long)p+0x1);
//
//	// 0x00100000 + 4  = 0x 00100004 
//	printf("%p\n", (unsigned int*)p + 0x1);
//
//	return 0;
//}